InformationRegisters/кб99_Параметры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кб99_Параметры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/кб99_СтатусЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кб99_СтатусЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>COMPLETED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>REJECTED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IN_PROCESS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ACCEPTED</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПартииВСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПартииВСД</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.кб99_ОстаткиПартийВСД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВСД_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВСД_Хозсубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПартииРезультат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВСД2_КорректировкаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВСД2_КорректировкаРеализации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВСДКАннулированию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВСД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кб99_ВСД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусВСД</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_СтатусВСД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВСД2_транзакция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВСД2_транзакция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВСДКГашению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВСД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кб99_ВСД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусВСД</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_СтатусВСД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВСД2_транзакция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВСД2_транзакция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОформленныеКорректировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВСД2_транзакция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВСД2_транзакция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ВСД_Соответсвия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВСД_Соответсвия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПродукцияЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеСоответствие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ВетИС_ЯдроСервер/Ext/Module.bsl
// GRACE:MODULE_START name="ВетИС_ЯдроСервер"
// @grace-module: ВетИС_ЯдроСервер
// @grace-purpose: Ядро системы ВетИС: поиск объектов, параметры, организации, отправка ВСД, корень зависимостей
// @grace-depends: ВетИС_ПараметрыСервер, ВетИС_APIСервер, ВетИС_УтилитыКлиентСервер
// @grace-version: 2.0
// @grace-contract-ref: docs/Contracts.xml -> module="ВетИС_ЯдроСервер"
// LLM_NOTE: Центральный модуль ВетИС — является корнем зависимостей. Поиск партий вынесен в
// ВетИС_ПоискСервер, печать — в ВетИС_ПечатьСервер. Делегаторы сохранены для обратной совместимости.
// GRACE:DEPENDENCY target="ВетИС_ПараметрыСервер"
// GRACE:DEPENDENCY target="ВетИС_APIСервер"
// GRACE:DEPENDENCY target="ВетИС_УтилитыКлиентСервер"
// GRACE:DEPENDENCY target="ВетИС_ПоискСервер"
// GRACE:DEPENDENCY target="ВетИС_ПечатьСервер"

Функция ПроверитьСуществованиеКаталога(ИмяКаталога) Экспорт
	
	// LLM_NOTE: Проверка существования каталога для сохранения XML-запросов к ГИС Меркурий.
	//          Создание каталога выполняется пользователем вручную для обеспечения контроля над файловой системой.
	Если НЕ(ЗначениеЗаполнено( ИмяКаталога )) Тогда
		СообщитьИнфо("Имя каталога ["+ ИмяКаталога +"] указано неправильно");
		Возврат Ложь;
	КонецЕсли;	
	
    КаталогНаДиске = Новый Файл(ИмяКаталога);
    Если КаталогНаДиске.Существует() Тогда
        Возврат Истина;
    Иначе
        СообщитьИнфо("каталога ["+ ИмяКаталога +"] не найден, создайте для сохранения xml запросов...");
     	Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// GRACE:CONTRACT function="СообщитьПользователю"
Процедура СообщитьПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "",
		Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	ЭтоОбъект = Ложь;
	
	#Если НЕ (ТонкийКлиент ИЛИ ВебКлиент) Тогда
		Если КлючДанных <> Неопределено
		   И XMLТипЗнч(КлючДанных) <> Неопределено Тогда
			ТипЗначенияСтрокой = XMLТипЗнч(КлючДанных).ИмяТипа;
			ЭтоОбъект = Найти(ТипЗначенияСтрокой, "Object.") > 0;
		КонецЕсли;
	#КонецЕсли
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
		
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

// GRACE:CONTRACT function="СообщитьИнфо"
Процедура СообщитьИнфо(ТекстСообщения, Ссылка = Неопределено)  Экспорт
	СообщитьПользователю(ТекстСообщения, Ссылка);
КонецПроцедуры

// GRACE:CONTRACT function="кб99_СообщитьОбОшибке"
// LLM_NOTE: Запись в журнал регистрации используется для аудита ошибок ВСД.
//           Это критически важно для отслеживания проблем при интеграции с ГИС Меркурий.
Процедура кб99_СообщитьОбОшибке( ТекстСообщения, Ссылка = Неопределено, ИмяСобытия="ВСД Ошибка")  Экспорт
	
	ЗаписьЖурналаРегистрации( ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , Ссылка, ТекстСообщения, );
	СообщитьПользователю(ТекстСообщения, Ссылка);
	
КонецПроцедуры

// GRACE:CONTRACT function="ПолучитьЗначениеРевизитаОбъекта_НаСервере"
// LLM_NOTE: Исключение перехватывается для безопасного доступа к реквизитам объектов
//           разных типов метаданных без риска аварийного завершения.
Функция ПолучитьЗначениеРевизитаОбъекта_НаСервере( ВыбОбъект, Реквизит ) Экспорт
	
	Попытка
		Возврат ВыбОбъект[Реквизит];
	Исключение
		СообщитьИнфо("Указан неверный реквизит "+Реквизит+" для объекта "+ВыбОбъект);
		СообщитьИнфо(ОписаниеОшибки());
		Возврат "";
	КонецПопытки
	
КонецФункции

// GRACE:CONTRACT function="ПолучитьОрганизациюПоХС"
Функция ПолучитьОрганизациюПоХС(ВыбХозСубъект) Экспорт
	
	// LLM_NOTE: Поиск организации по ИНН хозяйствующего субъекта.
//           Используется для автоматического определения организации при работе с ВСД.
	Если ЗначениеЗаполнено(ВыбХозСубъект.ИНН) Тогда
		
		Рез = "";
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|   Организация.ссылка
		|ИЗ
		|   Справочник.Организации КАК Организация
		|ГДЕ 
		|	Организация.ИНН ПОДОБНО &ИНН";
	    Запрос.УстановитьПараметр("ИНН", ВыбХозСубъект.ИНН);
		
		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаОрг = РезультатЗапроса.Выбрать();

		Если ВыборкаОрг.Следующий() Тогда
			
			Возврат ВыборкаОрг.Ссылка;

		КонецЕсли;
	КонецЕсли;
	
	Возврат	ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();
	
КонецФункции

// GRACE:CONTRACT function="НайтиХозСубъект"
// LLM_NOTE: Находит или создает ВСД_ХозСубъект по контрагенту.
//           Сначала проверяет переопределения, затем ищет в соответствиях,
//           затем в Меркурии по ИНН. Это критическая точка интеграции.
Функция НайтиХозСубъект(Контрагент) Экспорт
	
	ПереопределенныйМодуль = ВетИС_УтилитыКлиентСервер.ФункцияПереопределена("НайтиХозСубъект");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.НайтиХозСубъект(Контрагент);
	КонецЕсли;
    
	Если НЕ(ЗначениеЗаполнено(Контрагент)) Тогда
		Возврат Справочники.ВСД_ХозСубъект.ПустаяСсылка();
	КонецЕсли;
	
	// стандартное поведение функции
	Если ВетИС_УтилитыКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контрагент, "ГоловнойКонтрагент") Тогда
		ВыбКонтрагент = ?(ЗначениеЗаполнено(Контрагент.ГоловнойКонтрагент),
				Контрагент.ГоловнойКонтрагент, Контрагент);
	Иначе
		ВыбКонтрагент = Контрагент;			
	КонецЕсли;
			
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВСД_ХозСубъект.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ВСД_ХозСубъект КАК ВСД_ХозСубъект
	                      |ГДЕ
	                      |	ВСД_ХозСубъект.Контрагент = &ВыбКонтрагент
	                      |	И ВСД_ХозСубъект.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)");
	Запрос.УстановитьПараметр("ВыбКонтрагент", ВыбКонтрагент );
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ХозсубъектСсылка = Результат.Ссылка;
		Если ХозсубъектСсылка.ПометкаУдаления Тогда
			ХозсубъектОбъект = ХозсубъектСсылка.ПолучитьОбъект();
			ХозсубъектОбъект.ПометкаУдаления = Ложь;
			ХозсубъектОбъект.Записать();
		КонецЕсли;
		Ответ = ХозсубъектСсылка;
	ИначеЕсли ЗначениеЗаполнено(ВыбКонтрагент) Тогда
		СпрХС = Справочники.ВСД_ХозСубъект.СоздатьЭлемент();
		СпрХС.Наименование = ВыбКонтрагент.Наименование;
		СпрХС.Контрагент = ВыбКонтрагент;
		СпрХС.Записать();
		СообщитьИнфо("Создан новый элемент справочника ВСД_ХозСубъект:"+ВыбКонтрагент);
		
		Ответ = спрХС.Ссылка;
	Иначе
		Ответ = Справочники.ВСД_ХозСубъект.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Ответ;
	 
КонецФункции

// GRACE:CONTRACT function="НайтиПлощадкуПоКонтрагенту"
Функция НайтиПлощадкуПоКонтрагенту(ВыбКонтрагент) Экспорт
	
	Если НЕ(ЗначениеЗаполнено(ВыбКонтрагент)) Тогда
         Возврат "";
     КонецЕсли;

     Запрос = Новый Запрос("ВЫБРАТЬ
                           |    ВСД_Площадка.Ссылка
                           |ИЗ
                           |    Справочник.ВСД_Площадка КАК ВСД_Площадка
                           |ГДЕ
                           |    ВСД_Площадка.Контрагент = &ВыбКонтрагент");
     Запрос.УстановитьПараметр("ВыбКонтрагент", ВыбКонтрагент );

     Результат = Запрос.Выполнить().Выбрать();

     Если Результат.Следующий() Тогда
         Ответ = Результат.Ссылка;
     Иначе
         Ответ = "";
     КонецЕсли;

     Возврат Ответ;
	 
КонецФункции

// GRACE:CONTRACT function="НайтиПлощадкуПоСкладу"
Функция НайтиПлощадкуПоСкладу(ВыбСклад, ВыбХозСубъект) Экспорт
	
	Если НЕ(ЗначениеЗаполнено(ВыбСклад)) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ(ЗначениеЗаполнено(ВыбХозСубъект)) Тогда
		СообщитьИнфо("Не указан параметр ВыбХозСубъект для ВСД.НайтиПлощадкуПоСкладу ");
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВСД_Площадка.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВСД_Площадка КАК ВСД_Площадка
	|ГДЕ
	|	ВСД_Площадка.ХозСубъект = &ХозСубъект
	|	И (ВСД_Площадка.Склад = &ВыбСклад
	|			ИЛИ ВСД_Площадка.Склады.Склад = &ВыбСклад)");  //!
	
	Запрос.УстановитьПараметр("ВыбСклад", ВыбСклад );
	Запрос.УстановитьПараметр("ХозСубъект", ВыбХозСубъект.Ссылка );
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Ответ = Результат.Ссылка;
	Иначе
		Ответ = "";
	КонецЕсли;
	
	Возврат Ответ;
	 
КонецФункции

// GRACE:CONTRACT function="ВыбратьПартию"
// LLM_NOTE: Выбирает партию по критериям: количество > 0, площадка, хозсубъект.
//           Возвращает первую подходящую партию для списания в ВСД.
Функция ВыбратьПартию(Продукция_Элемент, Отправитель_Площадка, Отпр_ХозСубъект) Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПоискСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПоискСервер.ВыбратьПартию(Продукция_Элемент, Отправитель_Площадка, Отпр_ХозСубъект);
КонецФункции

// GRACE:CONTRACT function="НайтиВсдТранзакцию"
Функция НайтиВсдТранзакцию(ДокСсылка, ЭтоПеремещениеотПоставщика = ЛОЖЬ) Экспорт
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ВСД2_транзакция") Тогда 
		
		Возврат ДокСсылка;
		
	ИначеЕсли ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ВСД2") Тогда 
		
		Возврат ДокСсылка.ДокОснование;
		
	ИначеЕсли ТипЗнч(ДокСсылка) = Тип("СправочникСсылка.кб99_ВСД2") Тогда 
		
		Возврат ДокСсылка.ДокументОснование;
		
	Иначе
		// ДокументОснование = Реализация и прочие ...
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументОснование" , ДокСсылка);
		Запрос.УстановитьПараметр("ЭтоПеремещение" , ЭтоПеремещениеотПоставщика);
		Запрос.Текст = "ВЫБРАТЬ
		            |	ВСД2_транзакция.Ссылка КАК Ссылка
		            |ИЗ
		            |	Документ.ВСД2_транзакция КАК ВСД2_транзакция
		            |ГДЕ
		            |	ВСД2_транзакция.ДокументОснование = &ДокументОснование
		            |	И ВСД2_транзакция.ПометкаУдаления = ЛОЖЬ
		            |	И ВСД2_транзакция.ЭтоПеремещениеОтПоставщика = &ЭтоПеремещение
		            |
					|";

		Выборка = Запрос.Выполнить().Выбрать();

	    Если Выборка.Следующий() Тогда
	        Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	 
	Возврат Неопределено;

КонецФункции

// GRACE:CONTRACT function="НайтиВСД_Производство"
Функция НайтиВСД_Производство(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос;
     Запрос.УстановитьПараметр("ДокументОснование" , ДокументОснование);

     Запрос.Текст = "ВЫБРАТЬ
                    |    ВСД2_Производство.Ссылка
                    |ИЗ
                    |    Документ.ВСД2_Производство КАК ВСД2_Производство
                    |ГДЕ
                    |    (ВСД2_Производство.ДокументОснование = &ДокументОснование)
					|    И (ВСД2_Производство.ПометкаУдаления = ЛОЖЬ)";

     Выборка = Запрос.Выполнить().Выбрать();

     Если Выборка.Следующий() Тогда
         Возврат Выборка.Ссылка;
     Иначе
         Возврат "";
     КонецЕсли;

КонецФункции

// GRACE:CONTRACT function="НайтиВСД"
Функция НайтиВСД(ДокументОснование) Экспорт

     Запрос = Новый Запрос;
     Запрос.УстановитьПараметр("ДокументОснование" , ДокументОснование);

	 Запрос.Текст = "ВЫБРАТЬ
	                |	ВСД2.Ссылка,
	                |	ВСД2.UUID
	                |ИЗ
	                |	Документ.ВСД2 КАК ВСД2
	                |ГДЕ
	                |	ВСД2.ДокументОснование = &ДокументОснование
	                |
	                |ОБЪЕДИНИТЬ
	                |
	                |ВЫБРАТЬ
	                |	кб99_ВСД2.Ссылка,
	                |	кб99_ВСД2.UUID
	                |ИЗ
	                |	Справочник.кб99_ВСД2 КАК кб99_ВСД2
	                |ГДЕ
	                |	кб99_ВСД2.ДокументОснование = &ДокументОснование";
	
     Выборка = Запрос.Выполнить().Выгрузить();

     Возврат Выборка;

КонецФункции

// GRACE:CONTRACT function="ПолучитьУсловияПеревозки"
// LLM_NOTE: HTTP-запрос к ГИС Меркурий для получения условий перевозки.
//           Является критическим местом интеграции с внешним API.
Функция ПолучитьУсловияПеревозки(ДокСсылка) Экспорт

	Параметры = ЗагрузитьПараметры( ДокСсылка.Организация );
	Ответ = ВетИС_APIСервер.ВСД2_Транзакция_УсловияПеревозки_Отправить(Параметры, ДокСсылка);
	
	Возврат Ответ;
	
КонецФункции

// GRACE:CONTRACT function="ОтправитьВСДвГИС"
// LLM_NOTE: Главная точка отправки любого типа ВСД в ГИС Меркурий.
//           Диспетчеризирует вызовы в зависимости от типа документа:
//           ВСД2_транзакция, ВСД2_входящий, ВСД2_Инвентаризация и др.
//           Является критическим местом интеграции с ГИС Меркурий.
Процедура ОтправитьВСДвГИС(Знач ДокСсылка, АдресХранилища = Неопределено) Экспорт
	
	Если ТипЗнч(ДокСсылка) = Тип("Структура")
			И ДокСсылка.Свойство("СписокДокументов") Тогда
			
		Для Каждого Док Из ДокСсылка.СписокДокументов Цикл
			ОтправитьВСДвГИС(Док, АдресХранилища);	
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
		
	Если ВетИС_УтилитыКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокСсылка, "Организация") Тогда 
		Организация = ДокСсылка.Организация;
	Иначе
		Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();
	КонецЕсли;
	
	Параметры = ЗагрузитьПараметры( Организация );
	
	ПараметрыФункции = Новый Структура;
	ПараметрыФункции.Вставить( "Параметры", Параметры );	
	ПараметрыФункции.Вставить( "ДокОснование", ДокСсылка );	
	
	Попытка
		Если типЗнч(ДокСсылка) = Тип("ДокументСсылка.ВСД2_транзакция") Тогда
			
			Если ЗначениеЗаполнено(ДокСсылка.ДокументОснование)
					И Не Параметры.ПарамРазрешитьВводНаОснованииБолееОдногоВСД 
					И НЕ ВетИС_ДокументооборотСервер.ПроверитьВозможностьОтправкиВСД(ДокСсылка.ДокументОснование, ДокСсылка) Тогда
				Возврат;
			КонецЕсли;

			Параметры["Отправитель_Площадка"] = ДокСсылка.Отправитель_Площадка;
			ПараметрыФункции.Вставить("СписокПартий", Новый Массив);
			Статус = ВетИС_APIСервер.ВСД2_транзакция_Отправить( ПараметрыФункции );
			
		ИначеЕсли типЗнч(ДокСсылка) = Тип("ДокументСсылка.ВСД2_Инвентаризация") Тогда
			
			Параметры["Отправитель_Площадка"] = ДокСсылка.Владелец_Площадка;
			ПараметрыФункции.Вставить("СписокПартий", Новый Массив);
			Статус = ВетИС_APIСервер.ВСД2_Инвентаризация_Отправить( ПараметрыФункции );
			
		ИначеЕсли типЗнч(ДокСсылка) = Тип("ДокументСсылка.ВСД2_ОбъединениеПартий") Тогда
			
			Параметры["Отправитель_Площадка"] = ДокСсылка.Владелец_Площадка;
			ПараметрыФункции.Вставить("СписокПартий", Новый Массив);
			Статус = ВетИС_APIСервер.ВСД2_ОбъединениеПартий_Отправить( ПараметрыФункции );
			
		ИначеЕсли типЗнч(ДокСсылка) = Тип("ДокументСсылка.ВСД2_Производство") Тогда
			
			Параметры["Отправитель_Площадка"] = ДокСсылка.Производитель_Площадка;
			ПараметрыФункции.Вставить("СписокПартий", Новый Массив);
			Статус = ВетИС_APIСервер.ВСД2_Производство_Отправить( ПараметрыФункции );
					
		ИначеЕсли типЗнч(ДокСсылка) = Тип("ДокументСсылка.ВСД2_ЛабораторныеИсследования") Тогда
			
			Параметры["Отправитель_Площадка"] = ДокСсылка.Партия.Производитель_Площадка;
			Статус = ВетИС_APIСервер.ВСД2_ЛабораторныеИсследования_Отправить( ПараметрыФункции );
			
		ИначеЕсли типЗнч(ДокСсылка) = Тип("ДокументСсылка.ВСД2_ОбновитьТранспорт") Тогда
			
			Статус = ВетИС_APIСервер.ВСД2_ОбновитьТранспорт_Отправить( ПараметрыФункции );
			
	    Иначе
			ДокВСД = НайтиВсдТранзакцию(ДокСсылка);
			Если Не ЗначениеЗаполнено(ДокВСД) Тогда
				СообщитьИнфо("Не найдены ВСД для Отправки");
				Возврат;
			КонецЕсли;			
		
			Если (ТипЗнч(ДокВСД) = Тип("ДокументСсылка.ВСД2_транзакция")) Тогда	
				Статус = ВетИС_APIСервер.ВСД2_транзакция_Отправить( ПараметрыФункции );
			Иначе
				СообщитьИнфо("документ "+ДокВСД+" не отправляется в ВЕТИС ");
			КонецЕсли;
		КонецЕсли;
	Исключение
		СообщитьИнфо("Ошибка в Процедуре ВСД ОтправитьВСДвГИС "+ОписаниеОшибки());
	КонецПопытки;
	
	РезультатОбработки = Новый Структура();
	РезультатОбработки.Вставить("ЗаданиеВыполнено", Статус = Перечисления.кб99_СтатусЗапроса.COMPLETED );

	Если ЗначениеЗаполнено( АдресХранилища ) Тогда 
		ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);	
	КонецЕсли;
	
КонецПроцедуры

// GRACE:CONTRACT function="ОтправитьВСД_Параллельно"
// LLM_NOTE: Параллельная отправка ВСД с использованием цикла ожидания результата.
//           До 10 итераций получения ответа с паузой между ними.
//           Критична для обработки множественных документов.
Процедура ОтправитьВСД_Параллельно(Знач Параметры, АдресХранилища=Неопределено) Экспорт
	
	СообщитьИнфо("Начало отправки ВСД в Ветис");	
	
	ДокСсылка = Неопределено;
	СписокДокументов = Неопределено;
	Параметры.Свойство("ДокСсылка", ДокСсылка);
	Параметры.Свойство("СписокДокументов", СписокДокументов);
	
	Если ЗначениеЗаполнено( ДокСсылка ) Тогда 
		СписокДокументов = Новый Массив;
		СписокДокументов.Добавить( ДокСсылка );
	КонецЕсли;
	
	Статус = "";
	ПараметрыОбщие = ВетИС_ЯдроСервер.ЗагрузитьПараметры( СписокДокументов[0].Организация );
	
	// запрос условий перевозки
	ОсновнойРегион = ПараметрыОбщие["Регион"];
	Для Каждого ДокСсылка Из СписокДокументов Цикл	
		Если ( ДокСсылка.УсловияПеревозки.Количество() = 0 ) Тогда
			ВетИС_APIСервер.ВСД2_Транзакция_УсловияПеревозки_Отправить( ПараметрыОбщие, ДокСсылка, Ложь  );
		КонецЕсли;		
	КонецЦикла;

	ВетИС_APIСервер.Пауза( Параметры["ПаузаСек"] );
	
	// ответ условий перевозки
	Для Каждого ДокСсылка Из СписокДокументов Цикл	
		Если ( ДокСсылка.УсловияПеревозки.Количество() = 0 ) Тогда
			applicationID = ВетИС_УтилитыКлиентСервер.НайтиApplicationID( ДокСсылка );
			Если ЗначениеЗаполнено( applicationID ) Тогда				
				Ответ =  ВетИС_APIСервер.ВСД2_Транзакция_УсловияПеревозки_ПолучитьОтвет( ПараметрыОбщие, applicationID, ДокСсылка, Ложь);
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;	
		
	// отправка
	СписокДокументовПолучитьОтвет = Новый Массив;
	Для Каждого ДокСсылка Из СписокДокументов Цикл	
		Если типЗнч(ДокСсылка) = Тип("ДокументСсылка.ВСД2_транзакция") Тогда
			
			Если ЗначениеЗаполнено(ДокСсылка.ДокументОснование)
					И Не Параметры.ПарамРазрешитьВводНаОснованииБолееОдногоВСД 
					И НЕ ВетИС_ДокументооборотСервер.ПроверитьВозможностьОтправкиВСД(ДокСсылка.ДокументОснование, ДокСсылка) Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыФункции = Новый Структура();
			ПараметрыФункции.Вставить("ДокОснование", ДокСсылка);
			ПараметрыФункции.Вставить("Параметры", ПараметрыОбщие);
			ПараметрыФункции.Вставить("ПолучитьОтветВетис", Ложь); 
			Статус = ВетИС_APIСервер.ВСД2_транзакция_Отправить(ПараметрыФункции);
			
		ИначеЕсли типЗнч(ДокСсылка) = Тип("ДокументСсылка.ВСД2_Производство") тогда
			
			ПараметрыФункции = Новый Структура();
			ПараметрыФункции.Вставить("ДокОснование", ДокСсылка);
			ПараметрыФункции.Вставить("Параметры", ПараметрыОбщие);
			ПараметрыФункции.Вставить("ПолучитьОтветВетис", Ложь); 
			Статус = ВетИС_APIСервер.ВСД2_Производство_Отправить(ПараметрыФункции);
			
		КонецЕсли;
		
		Если Статус = Перечисления.кб99_СтатусЗапроса.ACCEPTED Тогда 
			СписокДокументовПолучитьОтвет.Добавить( ДокСсылка );		
		КонецЕсли;
	КонецЦикла;
	
	ВетИС_APIСервер.Пауза( Параметры["ПаузаСек"] );
	
	// ответ 
	Для Каждого ДокСсылка Из СписокДокументовПолучитьОтвет Цикл
		applicationID = ВетИС_УтилитыКлиентСервер.НайтиApplicationID( ДокСсылка );
		
		ПараметрыФункции = Новый Структура();
		ПараметрыФункции.Вставить("ДокОснование", ДокСсылка);
		ПараметрыФункции.Вставить("Параметры", ПараметрыОбщие);
		ПараметрыФункции.Вставить("СделатьПаузу", Ложь);
		ПараметрыФункции.Вставить("ApplicationID", applicationID);
	
		Статус =  ВетИС_APIСервер.ПолучитьРезультат_ВСД2( ПараметрыФункции );	
		Для А=1 По 10 Цикл
			//Если (Статус="IN_PROCESS") Тогда
			Если Статус = Перечисления.кб99_СтатусЗапроса.IN_PROCESS Тогда 
				Статус =  ВетИС_APIСервер.ПолучитьРезультат_ВСД2( ПараметрыФункции );	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	
	РезультатОбработки = Новый Структура();
	РезультатОбработки.Вставить("ЗаданиеВыполнено", Статус = Перечисления.кб99_СтатусЗапроса.COMPLETED );
	
	Если ЗначениеЗаполнено( АдресХранилища ) Тогда 
		ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);	
	КонецЕсли;
	
	СообщитьИнфо("Отправка ВСД в Ветис завершена "+Статус);	
	
КонецПроцедуры

// GRACE:CONTRACT function="АннулироватьВСД"
// LLM_NOTE: Аннулирование ВСД в ГИС Меркурий.
//           Делегирует вызовы в ВетИС_APIСервер для различных типов документов.
Процедура АннулироватьВСД(ДокОснование) Экспорт
	
	Параметры = ЗагрузитьПараметры( ДокОснование.Организация );				
			
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ВСД2_транзакция") Тогда
		
		Параметры["Отправитель_Площадка"] = ДокОснование.Отправитель_Площадка;
		ВетИС_APIСервер.ВСД2_транзакция_Аннулировать( Параметры, ДокОснование );
		
	ИначеЕсли 
		(ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ВСД")) ИЛИ
		(ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ВСД2")) ИЛИ
		(ТипЗнч(ДокОснование) = Тип("СправочникСсылка.кб99_ВСД2")) Тогда 
		
		Параметры["Отправитель_Площадка"] = ДокОснование.Отправитель_Площадка;
		ПараметрыФункции = Новый Структура("Параметры, ДокОснование", Параметры, ДокОснование);
		ВетИС_APIСервер.ВСД2_Аннулировать( ПараметрыФункции );
		
	Иначе
		
		ВСД2_Транзакция_Ссылка = НайтиВсдТранзакцию(ДокОснование);
		Параметры["Отправитель_Площадка"] = ВСД2_Транзакция_Ссылка.Отправитель_Площадка;
		ВетИС_APIСервер.ВСД2_транзакция_Аннулировать(Параметры, ВСД2_Транзакция_Ссылка );
		
	КонецЕсли;
	
КонецПроцедуры

// GRACE:CONTRACT function="ОбновитьСтатусВСД"
Процедура ОбновитьСтатусВСД( ДокОснование ) Экспорт
	
	Параметры = ЗагрузитьПараметры( ДокОснование.Организация );				
	
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ВСД2_транзакция") Тогда
		  ВетИС_APIСервер.ВСД2_ЗагрузитьПоUUID( Параметры, ДокОснование );
	ИначеЕсли (ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ВСД")) ИЛИ
		 (ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ВСД2")) Тогда
	     ВетИС_APIСервер.ВСД2_ЗагрузитьПоUUID( Параметры, ДокОснование );
	 Иначе
		ВСД2_Транзакция_Ссылка = НайтиВсдТранзакцию( ДокОснование );
		ВетИС_APIСервер.ВСД2_ЗагрузитьПоUUID( Параметры, ВСД2_Транзакция_Ссылка );
	КонецЕсли;
	
КонецПроцедуры

Функция ПутьВСДВБраузере(ТестовыйРежим, _UUID, РежимПечать = Ложь)
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПечатьСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПечатьСервер.ПутьВСДВБраузере(ТестовыйРежим, _UUID, РежимПечать);
КонецФункции

// GRACE:CONTRACT function="ОткрытьВСДвГИС"
// LLM_NOTE: Формирует URL для открытия ВСД в браузере ГИС Меркурий.
//           Поддерживает тестовый и продуктивный режимы.
Функция ОткрытьВСДвГИС(ДокОснование) Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПечатьСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПечатьСервер.ОткрытьВСДвГИС(ДокОснование);
КонецФункции

// GRACE:CONTRACT function="ПечатьПолнойФормыВСД"
Функция ПечатьПолнойФормыВСД(ДокОснование) Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПечатьСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПечатьСервер.ПечатьПолнойФормыВСД(ДокОснование);
КонецФункции

// GRACE:CONTRACT function="ПечатьВнешнейФормыВСД"
Функция ПечатьВнешнейФормыВСД(Знач ДокОснование, ФайлВнешнейОбработки = "") Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПечатьСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПечатьСервер.ПечатьВнешнейФормыВСД(ДокОснование, ФайлВнешнейОбработки);
КонецФункции

// GRACE:CONTRACT function="ПечатьНаборныйЛист"
Функция ПечатьНаборныйЛист(Знач ДокОснование) Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПечатьСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПечатьСервер.ПечатьНаборныйЛист(ДокОснование);
КонецФункции

#Область Параметры

// GRACE:CONTRACT function="ЗагрузитьПараметры"
// LLM_NOTE: Загрузка параметров организации из регистра сведений.
//           Является критическим местом работы с безопасным хранилищем параметров.
//           Параметры включают авторизационные данные для ГИС Меркурий.
Функция ЗагрузитьПараметры( _Организация ) Экспорт
	
	ПараметрыОрганизации = ВетИС_ПараметрыСервер.ПараметрыСервер();
	ПараметрыОрганизации.Вставить("Организация", _Организация );
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	кб99_Параметры.Свойство КАК Свойство,
		|	кб99_Параметры.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.кб99_Параметры КАК кб99_Параметры
		|ГДЕ
		|	кб99_Параметры.Пользователь = &ВыбПользователь
		|	И кб99_Параметры.Организация = &ВыбОрганизация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	кб99_Параметры.Свойство КАК Свойство,
		|	кб99_Параметры.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.кб99_Параметры КАК кб99_Параметры
		|ГДЕ
		|	кб99_Параметры.Организация = &ВыбОрганизация
		|	И кб99_Параметры.Пользователь = """"";
	
	Запрос.УстановитьПараметр("ВыбПользователь", ИмяПользователя());
	Запрос.УстановитьПараметр("ВыбОрганизация",  _Организация);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если Не РезультатЗапроса[0].Пустой() Тогда
		Выборка = РезультатЗапроса[0].Выбрать();	
	ИначеЕсли Не РезультатЗапроса[1].Пустой() Тогда
		Выборка = РезультатЗапроса[1].Выбрать();
	Иначе
		ПараметрыОрганизации.Вставить("ПервыйЗапуск", Истина);
		Возврат ПараметрыОрганизации;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		Если ПараметрыОрганизации.Свойство(Выборка.Свойство) Тогда
			ПараметрыОрганизации[Выборка.Свойство] = Выборка.Значение;	
		КонецЕсли;
	КонецЦикла;
		
	ПараметрыОрганизации.Вставить("флСохранятьНастройкиДляТекущегоПользователя", Не РезультатЗапроса[0].Пустой());
	
	Возврат ПараметрыОрганизации;

КонецФункции

// GRACE:CONTRACT function="СохранитьПараметры"
// LLM_NOTE: Сохранение параметров в регистр сведений.
//           Является критическим местом записи в регистр.
Процедура СохранитьПараметры(Объект) Экспорт
	
	ПараметрыОрганизации = ВетИС_ПараметрыСервер.ПараметрыСервер();
	ОчисткаПерсональныхПараметров = Ложь;
	
	Если Объект.флСохранятьНастройкиДляТекущегоПользователя Тогда
		ВыбОбъект = ИмяПользователя();
	Иначе
		// Очистить персональные параметры в регистре при переходе на общие
		Выборка = РегистрыСведений.кб99_Параметры.Выбрать(Новый Структура("Пользователь", ИмяПользователя()));
		Пока Выборка.Следующий() Цикл
			Запись = Выборка.ПолучитьМенеджерЗаписи();
			Запись.Прочитать();
			Запись.Записать(Истина);
			Запись.Удалить();
			ОчисткаПерсональныхПараметров = Истина;
		КонецЦикла;

	КонецЕсли;
	
	Если ОчисткаПерсональныхПараметров Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Элемент из ПараметрыОрганизации Цикл 
		
		Запись = РегистрыСведений.кб99_Параметры.СоздатьМенеджерЗаписи();
		Если Объект.флСохранятьНастройкиДляТекущегоПользователя Тогда
			Запись.Пользователь = ВыбОбъект;	
		КонецЕсли;
		Запись.Организация = Объект.Организация;
		Запись.Свойство = Элемент.Ключ;
		Запись.Значение = Объект[Элемент.Ключ];
		Запись.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

// @Deprecated Логика перенесена в форму ФормаПараметры.ЗагрузитьПараметрыИзХранилища() (2026-03-29).
//             Вызовов из других мест нет. Удалить после подтверждения стабильности миграции.
// GRACE:CONTRACT function="ЗагрузитьПараметры_СтарыйВариант"
// LLM_NOTE: Загрузка параметров из хранилища общих настроек (устаревший вариант).
//           Использует безопасное хранилище для параметров авторизации.
Функция ЗагрузитьПараметры_СтарыйВариант( _Организация, ВладелецНастроек = Неопределено  ) Экспорт
	// ВладелецНастроек в параметрах - тогда можно загрузить настройки любого пользователя, а не текущего, м.б. пригодится...
	КлючОбъекта = "Обработка.Интеграция_ГИС_Меркурий.Форма.ФормаУФ";
  	Если ВладелецНастроек = Неопределено Тогда
		ВладелецНастроек = ИмяПользователя();
	КонецЕсли;
	
	Попытка
		 // Проверим, как хранятся настройки у конкретного пользователя: Личные или по организации
		флСохранятьНастройкиДляТекущегоПользователя = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,"НастройкиВСДПоПользователю",,ВладелецНастроек); // на пользователя
		 
		Если (флСохранятьНастройкиДляТекущегоПользователя = Неопределено) или НЕ флСохранятьНастройкиДляТекущегоПользователя Тогда 		 
			флСохранятьНастройкиДляТекущегоПользователя = Ложь;
			
			СписокПараметров = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, _Организация.УникальныйИдентификатор(), , _Организация.УникальныйИдентификатор());
		Иначе 
		 	СписокПараметров = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, _Организация.УникальныйИдентификатор(), , ВладелецНастроек); 
		КонецЕсли;
	Исключение
		СообщитьИнфо("Нет прав на восстановление настроек.");
	КонецПопытки;

	Если СписокПараметров = Неопределено Тогда
		СообщитьИнфо("Не удалось загрузить настройки "+_Организация+" - "+КлючОбъекта+" - "+ВладелецНастроек);
		СписокПараметров = Новый("Структура");
	КонецЕсли;

	СписокПараметров.Вставить("Организация", _Организация );
	СписокПараметров.Вставить("флСохранятьНастройкиДляТекущегоПользователя",флСохранятьНастройкиДляТекущегоПользователя);
	
	Возврат СписокПараметров;

КонецФункции

// GRACE:CONTRACT function="ЗагрузитьПараметрыВОбработку"
Процедура ЗагрузитьПараметрыВОбработку(Объект, СписокПараметров) Экспорт
	
	Попытка
		ЗаполнитьЗначенияСвойств(Объект, СписокПараметров); // не работает, т.к.  СписокПараметров = Соответствие
		
		Если Объект.Свойство("ВСД_Экспертиза") И НЕ(ЗначениеЗаполнено(Объект.ВСД_Экспертиза)) Тогда		
			Объект.ВСД_Экспертиза 	= "Произ.лабор ";
		КонецЕсли;
		
		Если Объект.Свойство("ВСД_Местность") И НЕ(ЗначениеЗаполнено(Объект.ВСД_Местность))  Тогда 
			Объект.ВСД_Местность 	= "местность благополучная по остро инфекционным заболеваниям с\х животных и птиц";
		КонецЕсли;

		Если Объект.Свойство("ПаузаСек") И НЕ(ЗначениеЗаполнено(Объект.ПаузаСек)) Тогда
			Объект.ПаузаСек=10;
		КонецЕсли;
					
		Если Объект.Свойство("НазваниеРеквизитаКоличество") И НЕ ЗначениеЗаполнено(Объект.НазваниеРеквизитаКоличество) Тогда
			Объект.НазваниеРеквизитаКоличество = "Количество";
		КонецЕсли;	
		
	Исключение
		СообщитьИнфо("Используется несоответствующия версии cf и обработки -> Проведите полное обновление !");
	    СообщитьИнфо(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Продукция_Элемент
	
// GRACE:CONTRACT function="ПолучитьНоменклатуруПоПродукцияЭлемент"
// LLM_NOTE: Получение соответствия ВСД_Продукция_Элемент -> Номенклатура.
//           Используется для обратного поиска при работе с партиями.
Функция ПолучитьНоменклатуруПоПродукцияЭлемент(ПродукцияЭлемент, ТолькоПервыйЭлемент = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВСД_Соответсвия.Владелец КАК Номенклатура
	               |ИЗ
	               |	Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
	               |ГДЕ
	               |	ВСД_Соответсвия.ПродукцияЭлемент = &ВыбПродукцияЭлемент
	               |	И ВСД_Соответсвия.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ВыбПродукцияЭлемент", ПродукцияЭлемент);	
	Если ТолькоПервыйЭлемент Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Номенклатура;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		ТзВрем = Запрос.Выполнить().Выгрузить();
		ТзВрем.ВыгрузитьКолонку("Номенклатура");
		Возврат ТзВрем.ВыгрузитьКолонку("Номенклатура");		
	КонецЕсли;
	
КонецФункции

// GRACE:CONTRACT function="ПолучитьСписок_ВСД_Продукция_ЭлементПоНоменклатуре"
Функция ПолучитьСписок_ВСД_Продукция_ЭлементПоНоменклатуре(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|    ВСД_Соответсвия.ПродукцияЭлемент КАК ПродукцияЭлемент
	|ИЗ
	|    Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
	|ГДЕ
	|    ВСД_Соответсвия.Владелец = &ВыбНоменклатура
	//|    И НЕ ВСД_Соответсвия.ПродукцияЭлемент.ПометкаУдаления
	|	 И НЕ ВСД_Соответсвия.ПометкаУдаления";
	Запрос.УстановитьПараметр("ВыбНоменклатура", Номенклатура);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции

// GRACE:CONTRACT function="Установить_Соответствие_ВСД_Продукция_Элемент"
// LLM_NOTE: Установка соответствия между номенклатурой и продукцией ВСД.
//           Критична для справочника соответствий, влияет на подбор партий.
Процедура Установить_Соответствие_ВСД_Продукция_Элемент( ВыбНоменклатура, ВыбПродукцияЭлемент) Экспорт
	
	//НачатьТранзакцию();
	Попытка
		// 1. Очистим все соответсвия по Номенклатуре
		ОчиститьСоответствие_ВСД_Продукция_Элемент( ВыбНоменклатура, ВыбПродукцияЭлемент );
		
		// 2. Установить новое соответствие
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|    ВСД_Соответсвия.Ссылка КАК Ссылка,
        |    ВСД_Соответсвия.ПродукцияЭлемент КАК ПродукцияЭлемент
        |ИЗ
        |    Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
        |ГДЕ
        |    ВСД_Соответсвия.Владелец = &ВыбНоменклатура 
		|    И ВСД_Соответсвия.ПродукцияЭлемент = &ВыбПродукцияЭлемент
		|";
		Запрос.УстановитьПараметр("ВыбНоменклатура", ВыбНоменклатура);
		Запрос.УстановитьПараметр("ВыбПродукцияЭлемент", ВыбПродукцияЭлемент);

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СпрОбъект.УстановитьПометкуУдаления(Ложь);
		Иначе
			СпрОбъект = Справочники.ВСД_Соответсвия.СоздатьЭлемент();
			СпрОбъект.Владелец = ВыбНоменклатура;
			СпрОбъект.ПродукцияЭлемент = ВыбПродукцияЭлемент; 
			СпрОбъект.Наименование = ВыбПродукцияЭлемент.Наименование;
			СпрОбъект.Записать();
		КонецЕсли;
		//ЗафиксироватьТранзакцию();
		СообщитьИнфо(""+ВыбНоменклатура+" --> "+ВыбПродукцияЭлемент+ " : установлено соответствие");
		
	Исключение
		//ОтменитьТранзакцию();	
		СообщитьИнфо(ОписаниеОшибки());
	КонецПопытки;
 
КонецПроцедуры

// GRACE:CONTRACT function="ОчиститьСоответствие_ВСД_Продукция_Элемент"
Процедура ОчиститьСоответствие_ВСД_Продукция_Элемент( ВыбНоменклатура, ВыбПродукцияЭлемент = Неопределено ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|    ВСД_Соответсвия.Ссылка КАК Ссылка,
    |    ВСД_Соответсвия.ПродукцияЭлемент КАК ПродукцияЭлемент
    |ИЗ
    |    Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
    |ГДЕ
    |    ВСД_Соответсвия.Владелец = &ВыбНоменклатура
	|";
	Если ЗначениеЗаполнено(ВыбПродукцияЭлемент) Тогда 
		Запрос.Текст = Запрос.Текст +"
			|    И ВСД_Соответсвия.ПродукцияЭлемент = &ВыбПродукцияЭлемент";
	КонецЕсли;
			
	Запрос.УстановитьПараметр("ВыбНоменклатура", ВыбНоменклатура);
	Запрос.УстановитьПараметр("ВыбПродукцияЭлемент", ВыбПродукцияЭлемент);

	Выборка = Запрос.Выполнить().Выгрузить();
	Для Каждого ВыборкаСтрока Из Выборка Цикл
		СпрОбъект = ВыборкаСтрока.Ссылка.ПолучитьОбъект();
		СпрОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
КонецПроцедуры

// GRACE:CONTRACT function="Продукция_Элемент_ПолучитьПоНоменклатуре"
Функция Продукция_Элемент_ПолучитьПоНоменклатуре(ВыбНоменклатура, Контрагент = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВСД_Соответсвия.ПродукцияЭлемент КАК ПродукцияЭлемент,
	               |	ВСД_Соответсвия.Контрагент КАК Контрагент,
	               |	1 КАК Порядок
	               |ИЗ
	               |	Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
	               |ГДЕ
	               |	НЕ ВСД_Соответсвия.ПометкаУдаления
	               |	И ВСД_Соответсвия.Владелец = &ВыбНоменклатура
	               |	И ВСД_Соответсвия.Контрагент = &Контрагент
	               |	И НЕ ВСД_Соответсвия.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	И НЕ ВСД_Соответсвия.ПродукцияЭлемент.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВСД_Соответсвия.ПродукцияЭлемент,
	               |	ВСД_Соответсвия.Контрагент,
	               |	2
	               |ИЗ
	               |	Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
	               |ГДЕ
	               |	НЕ ВСД_Соответсвия.ПометкаУдаления
	               |	И ВСД_Соответсвия.ОсновноеСоответствие
	               |	И НЕ ВСД_Соответсвия.ПродукцияЭлемент.ПометкаУдаления
	               |	И ВСД_Соответсвия.Владелец = &ВыбНоменклатура
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВСД_Соответсвия.ПродукцияЭлемент,
	               |	ВСД_Соответсвия.Контрагент,
	               |	3
	               |ИЗ
	               |	Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
	               |ГДЕ
	               |	ВСД_Соответсвия.Владелец = &ВыбНоменклатура
	               |	И НЕ ВСД_Соответсвия.ПродукцияЭлемент.ПометкаУдаления
	               |	И НЕ ВСД_Соответсвия.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок";
    Запрос.УстановитьПараметр("ВыбНоменклатура", ВыбНоменклатура); 
	Запрос.УстановитьПараметр("Контрагент", ?(Контрагент=Неопределено, Справочники.Контрагенты.ПустаяСсылка(), Контрагент)); 

    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать(); 
	
	ПродукцияЭлемент = Справочники.ВСД_Продукция_Элемент.ПустаяСсылка();	
	Если Выборка.Следующий() Тогда 
		ПродукцияЭлемент = Выборка.ПродукцияЭлемент;
    КонецЕсли; 
	
	Возврат ПродукцияЭлемент;
	
КонецФункции

// GRACE:CONTRACT function="Продукция_Элемент_ПолучитьСписок_ПоНоменклатуреИКонтрагенту"
Функция Продукция_Элемент_ПолучитьСписок_ПоНоменклатуреИКонтрагенту(ВыбНоменклатура, Контрагент = Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВСД_Соответсвия.ПродукцияЭлемент КАК ПродукцияЭлемент,
	|	ВСД_Соответсвия.Контрагент КАК Контрагент,
	|	2 КАК Порядок
	|ИЗ
	|	Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
	|ГДЕ
	|	ВСД_Соответсвия.Владелец = &ВыбНоменклатура
	|	И НЕ ВСД_Соответсвия.ПометкаУдаления 
	|
	| @ЗапросПоКонтрагенту@ 
	|";
    Запрос.УстановитьПараметр("ВыбНоменклатура", ВыбНоменклатура); 
	Если Контрагент <> Неопределено Тогда
		ПодстрокаЗамены =  "ОБЪЕДИНИТЬ
							|
							|ВЫБРАТЬ
							|	ВСД_Соответсвия.ПродукцияЭлемент,
							|	ВСД_Соответсвия.Контрагент,
							|	1
							|ИЗ
							|	Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
							|ГДЕ
							|	НЕ ВСД_Соответсвия.ПометкаУдаления
							|	И ВСД_Соответсвия.Владелец = &ВыбНоменклатура
							|	И ВСД_Соответсвия.Контрагент = &Контрагент
							|
							|УПОРЯДОЧИТЬ ПО
							|	Порядок";
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Иначе
		ПодстрокаЗамены = "";	
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "@ЗапросПоКонтрагенту@", ПодстрокаЗамены);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПоЗапросу = РезультатЗапроса.Выбрать();
	ВыборкаПоЗапросу.Следующий();
	Если ЗначениеЗаполнено(ВыборкаПоЗапросу.Контрагент) Тогда
		ВыборкаПоЗапросу = РезультатЗапроса.Выбрать();
		Пока ВыборкаПоЗапросу.Следующий() Цикл
			Если ВыборкаПоЗапросу.Контрагент = Контрагент И ВыборкаПоЗапросу.Порядок=1 Тогда
				Результат.Добавить(ВыборкаПоЗапросу.ПродукцияЭлемент);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ВыборкаПоЗапросу = РезультатЗапроса.Выбрать();
		Пока ВыборкаПоЗапросу.Следующий() Цикл
			Если Не ЗначениеЗаполнено(ВыборкаПоЗапросу.Контрагент) Тогда
				Результат.Добавить(ВыборкаПоЗапросу.ПродукцияЭлемент);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// GRACE:CONTRACT function="УстановитьСоответствиеСписку_ВСД_Продукция_Элемент"
Процедура УстановитьСоответствиеСписку_ВСД_Продукция_Элемент(СписокНоменклатуры,ВСДЭлемент) Экспорт
	Для Каждого Элемент Из СписокНоменклатуры Цикл
		Установить_Соответствие_ВСД_Продукция_Элемент(Элемент.Значение,ВСДЭлемент);
	КонецЦикла; 	
КонецПроцедуры

// GRACE:CONTRACT function="УдалитьСоответствиеСписку_ВСД_Продукция_Элемент"
Процедура УдалитьСоответствиеСписку_ВСД_Продукция_Элемент(СписокНоменклатуры,ВСДЭлемент) Экспорт
	Для Каждого Элемент Из СписокНоменклатуры Цикл
		ОчиститьСоответствие_ВСД_Продукция_Элемент(Элемент.Значение,ВСДЭлемент);
	КонецЦикла; 	
КонецПроцедуры

// Формирует список Партий по Фильтру
// для заполнения ТЧ ВСД2_Инвентаризация
Функция СписокАктуальныхПартийПоФильтру_Запрос(ВСД_Продукция_Элемент="",ВСД_Площадка="", ВСД_ХозСубъект="") Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПоискСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПоискСервер.СписокАктуальныхПартийПоФильтру_Запрос(ВСД_Продукция_Элемент, ВСД_Площадка, ВСД_ХозСубъект);
КонецФункции

#Область Партии

// GRACE:CONTRACT function=ПолучитьАктуальныеПартии
// LLM_NOTE: Запрос актуальных партий из справочника ВСД_Партия с фильтрацией по продукции, площадке, хозсубъекту.
//           Поддерживает настраиваемую сортировку (FIFO/LIFO).
//           Является критическим местом для подбора партий при оформлении ВСД.
Функция ПолучитьАктуальныеПартии(Знач Параметры, ВыбПродукция_Элемент, ВыбПлощадка, ВыбХозСубъект, ПолеСортировкиПокупателя=Неопределено, ЗнакСортировкиПокупателя=Неопределено, Номенклатура=Неопределено ) Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПоискСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПоискСервер.ПолучитьАктуальныеПартии(Параметры, ВыбПродукция_Элемент, ВыбПлощадка, ВыбХозСубъект, ПолеСортировкиПокупателя, ЗнакСортировкиПокупателя, Номенклатура);
КонецФункции

// GRACE:CONTRACT function=ПодобратьПартииПоПродукцияЭлемент_
// LLM_NOTE: Подбор партий по одному элементу продукции с учетом срока годности.
//           Внутренняя версия функции для обработки таблицы партий.
Функция ПодобратьПартииПоПродукцияЭлемент_( ПараметрыФункции, тзПартий, ПродукцияЭлемент, КолвоСписания, СерияНоменклатуры="", Номенклатура=Неопределено, Контрагент = Неопределено ) Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПоискСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПоискСервер.ПодобратьПартииПоПродукцияЭлемент_( ПараметрыФункции, тзПартий, ПродукцияЭлемент, КолвоСписания, СерияНоменклатуры, Номенклатура, Контрагент );
КонецФункции

// GRACE:CONTRACT function=ПодобратьПартииПоПродукцияЭлемент
// LLM_NOTE: Подбор партий по элементу продукции с контролем срока годности.
//           Является критическим местом для подбора партий при оформлении ВСД.
Функция ПодобратьПартииПоПродукцияЭлемент( ПараметрыФункции, тзПартий, ПродукцияЭлемент, КолвоСписания, СерияНоменклатуры="", Номенклатура=Неопределено, Контрагент = Неопределено ) Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПоискСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПоискСервер.ПодобратьПартииПоПродукцияЭлемент( ПараметрыФункции, тзПартий, ПродукцияЭлемент, КолвоСписания, СерияНоменклатуры, Номенклатура, Контрагент );
КонецФункции

// GRACE:CONTRACT function=ПодобратьПартии
Функция ПодобратьПартии( тзПартий, КолвоСписания ) Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПоискСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПоискСервер.ПодобратьПартии( тзПартий, КолвоСписания );
КонецФункции

// GRACE:CONTRACT function=тзПартииСписанияПоТзПродукция_Элемент
// LLM_NOTE: Главная функция подбора партий для списания по списку элементов продукции.
//           Поддерживает переопределение через ВетИС_УтилитыКлиентСервер.
Функция тзПартииСписанияПоТзПродукция_Элемент(Параметры, тзЭлементыкСписанию, тзАктуальныхПартий = "", ПолеСортировки=Неопределено, ЗнакСортировки = Неопределено, Контрагент = Неопределено) Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПоискСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПоискСервер.тзПартииСписанияПоТзПродукция_Элемент(Параметры, тзЭлементыкСписанию, тзАктуальныхПартий, ПолеСортировки, ЗнакСортировки, Контрагент);
КонецФункции

// GRACE:CONTRACT function=ПолучитьПартииПоДокументамПроизводства
// LLM_NOTE: Получение партий, созданных в результате оформления производства.
//           Используется для корректного заполнения табличной части партий списания.
Функция ПолучитьПартииПоДокументамПроизводства(СписокДокументов, ПолеСортировки) Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПоискСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПоискСервер.ПолучитьПартииПоДокументамПроизводства(СписокДокументов, ПолеСортировки);
КонецФункции

#КонецОбласти

// GRACE:CONTRACT function="ПолучитьПутьКСправкеВИКИ"
Функция ПолучитьПутьКСправкеВИКИ( Ссылка ) Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПечатьСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПечатьСервер.ПолучитьПутьКСправкеВИКИ(Ссылка);
КонецФункции

// GRACE:CONTRACT function="ПолучитьПутьКПриложениюУдаленнойПоддержки"
Функция ПолучитьПутьКПриложениюУдаленнойПоддержки() Экспорт
	// LLM_NOTE: Делегатор — реализация перенесена в ВетИС_ПечатьСервер (декомпозиция Wave 5)
	Возврат ВетИС_ПечатьСервер.ПолучитьПутьКПриложениюУдаленнойПоддержки();
КонецФункции

Процедура ОформитьДокументПартииВСД(ПараметрыФункции) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВСД_Партия.Ссылка КАК Партия,
	|	ВСД_Партия.НомерЗаписи КАК НомерЗаписи,
	|	ВСД_Партия.ДатаИзготовления1 КАК ДатаИзготовления,
	|	ВСД_Партия.ДатаСрокГодности1 КАК СрокГодности,
	|	ВСД_Партия.Количество КАК Количество
	|ИЗ
	|	Справочник.ВСД_Партия КАК ВСД_Партия
	|ГДЕ
	|	ВСД_Партия.Ссылка В (&СписокПартий)";
	Запрос.УстановитьПараметр("СписокПартий", ПараметрыФункции.СписокПартий);	
	
	ДокПартии					 = Документы.ПартииВСД.СоздатьДокумент();
	ДокПартии.Дата				 = ТекущаяДатаСеанса();
	ДокПартии.Организация		 = ПараметрыФункции.Организация;
	ДокПартии.ВСД_Хозсубъект	 = ПараметрыФункции.Отправитель_ХозСубъект;
	ДокПартии.ВСД_Площадка		 = ПараметрыФункции.Отправитель_Площадка;
	
	ДокПартии.ПартииРезультат.Загрузить(Запрос.Выполнить().Выгрузить());
	Если ДокПартии.ПартииРезультат.Количество() Тогда
		ДокПартии.Записать(РежимЗаписиДокумента.Проведение);
		РегистрыСведений.кб99_ОстаткиПартийВетис.ЗаписатьОстаткиПартий(ДокПартии.ПартииРезультат, ДокПартии.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиСуществующийДокументКорректировкаВСД(Знач КорректировкаСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВСД2_КорректировкаРеализации.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВСД2_КорректировкаРеализации КАК ВСД2_КорректировкаРеализации
		|ГДЕ
		|	ВСД2_КорректировкаРеализации.ДокументОснование = &ДокументОснование
		|	И ВСД2_КорректировкаРеализации.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДокументОснование", КорректировкаСсылка);
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ВСД2_КорректировкаРеализации.ПустаяСсылка();
	
КонецФункции

// GRACE:MODULE_END name="ВетИС_ЯдроСервер"
